

# Python算术运算符：
#    +  -  *  /（除不尽得到小数）  %（取余数）  //（整除:向下取整——比我小的最大整数）   **（次方，取幂）
print(10 + 4)   # 14
print(10 - 4)   # 6
print(10 * 4)   # 40
print(10 / 4)   # 2.5
print(10 % 4)   # 取余数，2
print(10 // 4)  # 向下取整，保留整数，2
print(10 ** 4)  # 10000
print(10 ** 0.5)  # 开根号，结果为10的0.5次方，即10的平方根，结果为3.1622776601683795

print(-10 / 4)  # -2.5
print(-10 // 4)  # -3  向下取整，比我小的最大整数，-3
print(10 // -4)  # -3  向下取整，比我小的最大整数，-3
print(-10 // -4)  # 2  向下取整，比我小的最大整数，2


# 科学计数法
a = 3.14 * 10 ** 3  
b = 3.14e3
print(a,b)  #  3.14 * 1000 = 3140.0
a = 3.14 * 10 ** -3  
b = 3.14e-3
print(a,b)  # 3.14 * 0.001 = 0.00314


# 常见内存单位：
# 1b = 0 或 1            1位
# 1B(Byte) = 8bit        1字节
# 1KB = 1024Byte         1千字节
# 1MB = 1024KB           1兆字节
# 1GB = 1024MB           1千兆字节
# 1TB = 1024GB           1太字节
# 1PB = 1024TB           1拍字节   目前大公司一天可能产生的数据量
# 1EB = 1024PB           1艾字节
# ...


# Q：从控制台输入一个三位数，输出它的个位、十位、百位
num = int(input("请输入一个三位数："))
# 取个位： num % 10
print("个位：{}".format(num % 10))
# 取十位： num // 10 % 10
print("十位：{}".format(num // 10 % 10)) 
# 取百位： num // 100 % 10
print("百位：{}".format(num // 100 % 10))

