
# Python
#   不可变类型: int,float,str,tuple,bool,NoneType
#    可变类型: list, set, dict

# 赋值
# 不可变类型 (没有关联)
a = 1
b = a
b = 2
print(a, b)          # 1 2
print(id(a), id(b))  # 不同内存地址 140707574739752 140707574739784

# 可变类型 (有关联)
a = [1, 2, 3]
b = a
b[0] = 100
print(a, b)          # [100, 2, 3] [100, 2, 3]
print(id(a), id(b))  # 相同地址 1596765184960 1596765184960


# 深浅拷贝的可视化视图
#  http://pythontutor.com/live.html#mode=edit

# copy: 浅拷贝/浅复制
a = [1, 2, 3]
b = a.copy()
b[0] = 100
print(a, b)            # [1, 2, 3] [100, 2, 3]
print(id(a), id(b))    # 不同地址 1700789450688 1700789440576


# deepcopy 深拷贝(针对二维或者多位数组)
a = [1, 2, [3, 4]]
b = a.copy()           # 浅拷贝二维列表共用，二维列表开辟空间的过程不拷贝
b[0] = 100
b[-1][-1] = 300
print(a, b)        # [1, 2, [3, 300]] [100, 2, [3, 300]]
print(id(a), id(b))             # 2946959876160 2946959964096
print(id(a[2]), id(b[2]))       # 1805278192576 1805278192576 二维列表地址相同

import copy
a = [1, 2, [3, 4]]
b = copy.deepcopy(a)    # 深拷贝二维列表不共用，二维列表开辟空间的过程也会拷贝
b[0] = 100
b[-1][-1] = 300
print(a, b)        # [1, 2, [3, 4]] [100, 2, [3, 300]]
print(id(a), id(b))             # 1235135264640 1235135264448
print(id(a[2]), id(b[2]))       # 2222078329152 2222078064128  二维列表地址不同